<?php 
//--------------------------Настройки подключения к БД-----------------------
$db_host = 'std-mysql';
$db_user = 'std_1990_moscowparks'; //имя пользователя совпадает с именем БД
$db_password = '12345678'; //пароль, указанный при создании БД
$database = 'std_1990_moscowparks'; //имя БД, которое было указано при создании
$link = mysqli_connect($db_host, $db_user, $db_password, $database);
if ($link == False) {
    die("Cannot connect DB");
}

//----------------------------------------------------------------------------------------

?>